## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                          |
|----------|--------------------------------------------------------|
| recreate | `aws_lambda_event_source_mapping.reprocess_submission` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.reprocess_submission must be replaced
-/+ resource "aws_lambda_event_source_mapping" "reprocess_submission" {
      ~ arn                                = "arn:aws:lambda:ca-central-1:687401027353:event-source-mapping:e9bf5752-e38a-4dd8-9d2e-489597c00ef1" -> (known after apply)
      - bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:ca-central-1:687401027353:reprocess_submission_queue.fifo" -> "arn:aws:sqs:ca-central-1:687401027353:reprocess_submission_queue" # forces replacement
      ~ function_arn                       = "arn:aws:lambda:ca-central-1:687401027353:function:reliability" -> (known after apply)
      - function_response_types            = [] -> null
      ~ id                                 = "e9bf5752-e38a-4dd8-9d2e-489597c00ef1" -> (known after apply)
      ~ last_modified                      = "2025-06-04T18:26:57Z" -> (known after apply)
      + last_processing_result             = (known after apply)
      - maximum_batching_window_in_seconds = 0 -> null
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
      - queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
      - tags                               = {} -> null
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "e9bf5752-e38a-4dd8-9d2e-489597c00ef1" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ amazon_managed_kafka_event_source_config (known after apply)

      ~ self_managed_kafka_event_source_config (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_end_to_end_test"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN -...
```

</details>
